#+TITLE: post0
#+INCLUDE: "./boilerplate.org"
#+EXPORT_FILE_NAME: ../src/routes/about/[post]/post0

NOTE Most! code org and html boilerplate is imported from boilerplate.org
NOTE #+OPTIONS: H:6 makes the exporter create outline-containers beyond the default 4 levels (this is needed for folding)

*** TODO bash
:LOGBOOK:
- State "TODO"       from              [2025-10-04 Sat 09:51:21]
:END:
#+BEGIN_SRC bash :exports both
echo "hello world"
#+END_SRC

#+RESULTS:
: hello world

** DONE plotly chart
:LOGBOOK:
- State "DONE"       from              [2025-10-04 Sat 09:51:56]
:END:
#+BEGIN_SRC python :results output drawer
import plotly.express as px
import pandas as pd

df = pd.DataFrame({
    "Fruit": ["Apples", "Oranges", "Bananas", "Apples", "Oranges", "Bananas"],
    "Amount": [4, 1, 2, 2, 4, 5],
    "City": ["SF", "SF", "SF", "Montreal", "Montreal", "Montreal"]
})

fig = px.bar(df, x="Fruit", y="Amount", color="City", barmode="group")

# write to html file
fig.write_html("../static/my_interactive_plot.html")
#+END_SRC

#+RESULTS:
:results:
:end:

insert iframe to chart
NOTE the path is previous direcotry given how svelte builds the static site
#+begin_export html
<iframe src="../my_interactive_plot.html" width="100%" height="600"></iframe>
#+end_export

